aoriger/FitLens/FitLens_premium/STM32_WPAN/App/app_ble.c
  /*Radio mask Activity*/
#if (OOB_DEMO != 0)
  ret = aci_hal_set_radio_activity_mask(0x0020);
  if (ret != BLE_STATUS_SUCCESS)
  {
    APP_DBG_MSG("  Fail   : aci_hal_set_radio_activity_mask command, result: 0x%x \n\r", ret);
  }
  else
  {
    APP_DBG_MSG("  Success: aci_hal_set_radio_activity_mask command\n\r");
  }
  APP_DBG_MSG("\n");
#endif
  /**
   * Initialize P2P Client Application
   */
  P2PC_APP_Init();

  /* USER CODE BEGIN APP_BLE_Init_3 */

  /* USER CODE END APP_BLE_Init_3 */

#if (OOB_DEMO != 0)
  HW_TS_Create(CFG_TIM_PROC_ID_ISR, &(BleApplicationContext.SwitchOffGPIO_timer_Id), hw_ts_SingleShot, Switch_OFF_GPIO);
#endif

#if (OOB_DEMO == 0)
  /**
   * Start scanning
   */
  UTIL_SEQ_SetTask(1 << CFG_TASK_START_SCAN_ID, CFG_SCH_PRIO_0);
#endif
  /* USER CODE BEGIN APP_BLE_Init_2 */

  /* USER CODE END APP_BLE_Init_2 */
  return;
}

#define HRM_SERVICE_UUID  0x180D

SVCCTL_UserEvtFlowStatus_t SVCCTL_App_Notification(void *pckt)
{
  hci_event_pckt *event_pckt;
  evt_le_meta_event *meta_evt;
  hci_le_connection_complete_event_rp0 * connection_complete_event;
  evt_blecore_aci *blecore_evt;
  hci_le_advertising_report_event_rp0 * le_advertising_event;
  event_pckt = (hci_event_pckt*) ((hci_uart_pckt *) pckt)->data;
  hci_disconnection_complete_event_rp0 *cc = (void *) event_pckt->data;
  uint8_t result;
  uint8_t event_type, event_data_size;
  int k = 0;
  uint8_t adtype, adlength;
#if (OOB_DEMO != 0)
  tBleStatus ret = BLE_STATUS_INVALID_PARAMS;
#endif

  switch (event_pckt->evt)
  {
    /* USER CODE BEGIN evt */
    /* USER CODE END evt */
    case HCI_VENDOR_SPECIFIC_DEBUG_EVT_CODE:
      {
        handleNotification.P2P_Evt_Opcode = PEER_DISCON_HANDLE_EVT;
        blecore_evt = (evt_blecore_aci*) event_pckt->data;
        /* USER CODE BEGIN EVT_VENDOR */

        /* USER CODE END EVT_VENDOR */
        switch (blecore_evt->ecode)
        {
          /* USER CODE BEGIN ecode */
          case ACI_ATT_READ_BY_TYPE_RESP_VSEVT_CODE:
          {
              aci_att_read_by_type_resp_event_rp0 *pr = (void*)blecore_evt->data;
              
              // 1. The characteristic handle is in bytes 0 and 1 of the data array
              // Note: The structure member is Handle_Value_Pair_Data, NOT Data
              uint16_t attr_handle = pr->Handle_Value_Pair_Data[0] | (pr->Handle_Value_Pair_Data[1] << 8);
              
              // 2. The Value Handle is in bytes 3 and 4
              uint16_t value_handle = pr->Handle_Value_Pair_Data[3] | (pr->Handle_Value_Pair_Data[4] << 8);
              
              // 3. The CCCD (Client Characteristic Configuration Descriptor) is always Value Handle + 1
              uint16_t cccd_handle = value_handle + 1; 

              APP_DBG_MSG("Found HR Char. Value Handle: 0x%04X. Writing to CCCD: 0x%04X\n\r", value_handle, cccd_handle);

              // 4. Enable Notifications (Write 0x0001 to CCCD)
              uint8_t enable_notif[2] = {0x01, 0x00};
              
              aci_gatt_write_char_desc(BleApplicationContext.BleApplicationContext_legacy.connectionHandle,
                                      cccd_handle,
                                      2,
                                      enable_notif);
          }
          break;

          case ACI_ATT_FIND_BY_TYPE_VALUE_RESP_VSEVT_CODE:
          {
            aci_att_find_by_type_value_resp_event_rp0 *pr = (void*)blecore_evt->data;
            
            BleApplicationContext.BleApplicationContext_legacy.hrm_serv_start_handle = 
              pr->Attribute_Group_Handle_Pair[0].Found_Attribute_Handle;
              
            BleApplicationContext.BleApplicationContext_legacy.hrm_serv_end_handle = 
              pr->Attribute_Group_Handle_Pair[0].Group_End_Handle;

            APP_DBG_MSG("-- HRM SERVICE FOUND Handle=0x%04X End=0x%04X --\n\r", 
              BleApplicationContext.BleApplicationContext_legacy.hrm_serv_start_handle,
              BleApplicationContext.BleApplicationContext_legacy.hrm_serv_end_handle);
          }
          break;

          case ACI_GATT_DISC_READ_CHAR_BY_UUID_RESP_VSEVT_CODE:
          {
            aci_gatt_disc_read_char_by_uuid_resp_event_rp0 *pr = (void*)blecore_evt->data;
            
            /* The Attribute_Value contains: [Properties (1B)] [Value Handle (2B)] [UUID (2/16B)] */
            uint16_t value_handle = pr->Attribute_Value[1] | (pr->Attribute_Value[2] << 8);

            APP_DBG_MSG("-- GATT : CHAR FOUND Handle=0x%04X, ValHandle=0x%04X -- \n\r", pr->Attribute_Handle, value_handle);
            
             BleApplicationContext.BleApplicationContext_legacy.hrm_char_value_handle = value_handle;
          }
          break;

          case ACI_GATT_PROC_COMPLETE_VSEVT_CODE:
          {
            aci_gatt_proc_complete_event_rp0 *pr = (void*)blecore_evt->data;
            APP_DBG_MSG("GATT Procedure Complete. Status: 0x%02X\n", pr->Error_Code);

            /* If we just finished searching for the Service, now search for the Char */
            if (BleApplicationContext.BleApplicationContext_legacy.hrm_serv_start_handle != 0 &&
                BleApplicationContext.BleApplicationContext_legacy.hrm_serv_end_handle != 0)
            {
               APP_DBG_MSG("** SEARCHING FOR HR CHAR (0x2A37) ** \n\r");
               UUID_t uuid_hr;
               uuid_hr.UUID_16 = 0x2A37;
               
               aci_gatt_disc_char_by_uuid(BleApplicationContext.BleApplicationContext_legacy.connectionHandle,
                   BleApplicationContext.BleApplicationContext_legacy.hrm_serv_start_handle,
                   BleApplicationContext.BleApplicationContext_legacy.hrm_serv_end_handle,
                   0x01,
                   &uuid_hr);
               
               BleApplicationContext.BleApplicationContext_legacy.hrm_serv_start_handle = 0;
               BleApplicationContext.BleApplicationContext_legacy.hrm_serv_end_handle = 0;
            }
            
            /* If we just finished searching for the Char, now Enable Notifications */
            else if (BleApplicationContext.BleApplicationContext_legacy.hrm_char_value_handle != 0)
            {
               uint16_t cccd_handle = BleApplicationContext.BleApplicationContext_legacy.hrm_char_value_handle + 1;
               APP_DBG_MSG("** ENABLING NOTIFICATIONS (CCCD=0x%04X) ** \n\r", cccd_handle);
               
