aoriger/FitLens/FitLens_premium/STM32_WPAN/App/app_ble.c
          /* USER CODE BEGIN BLUE_EVT */

          /* USER CODE END BLUE_EVT */

          default:
            /* USER CODE BEGIN ecode_default */

            /* USER CODE END ecode_default */
            break;
        }

      }
      break;

    case HCI_DISCONNECTION_COMPLETE_EVT_CODE:
      {
        /* USER CODE BEGIN EVT_DISCONN_COMPLETE */

        /* USER CODE END EVT_DISCONN_COMPLETE */
        if (cc->Connection_Handle == BleApplicationContext.BleApplicationContext_legacy.connectionHandle)
        {
          BleApplicationContext.BleApplicationContext_legacy.connectionHandle = 0;
          BleApplicationContext.Device_Connection_Status = APP_BLE_IDLE;
          APP_DBG_MSG("\r\n\r** DISCONNECTION EVENT WITH SERVER, Reason: 0x%02X ** \n\r", cc->Reason);
          handleNotification.P2P_Evt_Opcode = PEER_DISCON_HANDLE_EVT;
          handleNotification.ConnectionHandle = BleApplicationContext.BleApplicationContext_legacy.connectionHandle;
          P2PC_APP_Notification(&handleNotification);
        }
      }
      break; /* HCI_DISCONNECTION_COMPLETE_EVT_CODE */

    case HCI_LE_META_EVT_CODE:
      {
        /* USER CODE BEGIN EVT_LE_META_EVENT */

        /* USER CODE END EVT_LE_META_EVENT */
        meta_evt = (evt_le_meta_event*) event_pckt->data;

        switch (meta_evt->subevent)
        {
          /* USER CODE BEGIN subevent */

          /* USER CODE END subevent */

          case HCI_LE_CONNECTION_COMPLETE_SUBEVT_CODE:
            /* USER CODE BEGIN EVT_LE_CONN_COMPLETE */

            /* USER CODE END EVT_LE_CONN_COMPLETE */
            /**
             * The connection is done,
             */
            connection_complete_event = (hci_le_connection_complete_event_rp0 *) meta_evt->data;
            BleApplicationContext.BleApplicationContext_legacy.connectionHandle = connection_complete_event->Connection_Handle;
            BleApplicationContext.Device_Connection_Status = APP_BLE_CONNECTED_CLIENT;

            /* CONNECTION WITH CLIENT */
            APP_DBG_MSG("\r\n\r** CONNECTION COMPLETE EVENT WITH SERVER \n\r");
            handleNotification.P2P_Evt_Opcode = PEER_CONN_HANDLE_EVT;
            handleNotification.ConnectionHandle = BleApplicationContext.BleApplicationContext_legacy.connectionHandle;
            P2PC_APP_Notification(&handleNotification);

            /* ROBUST DISCOVERY: Step 1 - Find the Service First */
            UUID_t uuid_hr_serv;
            uuid_hr_serv.UUID_16 = 0x180D; 
            
            APP_DBG_MSG("\r\n\r** SEARCHING FOR HRM SERVICE (0x180D) ** \n\r");
            
            result = aci_gatt_disc_primary_service_by_uuid(BleApplicationContext.BleApplicationContext_legacy.connectionHandle,
                      0x01, &uuid_hr_serv);

            if (result != BLE_STATUS_SUCCESS)
            {
              APP_DBG_MSG("BLE_CTRL_App_Notification(), HR Service discovery Failed \r\n\r");
            }
            break; /* HCI_LE_CONNECTION_COMPLETE_SUBEVT_CODE */

          case HCI_LE_ADVERTISING_REPORT_SUBEVT_CODE:
            {
              uint8_t *adv_report_data;
              /* USER CODE BEGIN EVT_LE_ADVERTISING_REPORT */

              /* USER CODE END EVT_LE_ADVERTISING_REPORT */
              le_advertising_event = (hci_le_advertising_report_event_rp0 *) meta_evt->data;

              event_type = le_advertising_event->Advertising_Report[0].Event_Type;

              event_data_size = le_advertising_event->Advertising_Report[0].Length_Data;

              adv_report_data = (uint8_t*)(&le_advertising_event->Advertising_Report[0].Length_Data) + 1;
              k = 0;
              
              /* Debug: Print that we saw a packet from this address */
              APP_DBG_MSG("Scan: Device %02X:%02X:%02X:%02X:%02X:%02X, RSSI: %d\n\r",
                  le_advertising_event->Advertising_Report[0].Address[5],
                  le_advertising_event->Advertising_Report[0].Address[4],
                  le_advertising_event->Advertising_Report[0].Address[3],
                  le_advertising_event->Advertising_Report[0].Address[2],
                  le_advertising_event->Advertising_Report[0].Address[1],
                  le_advertising_event->Advertising_Report[0].Address[0],
                  le_advertising_event->Advertising_Report[0].RSSI);

              {
                /* ISOLATION OF BD ADDRESS AND LOCAL NAME */

                while(k < event_data_size)
                {
                  adlength = adv_report_data[k];
                  adtype = adv_report_data[k + 1];
                  switch (adtype)
                  {
                    case AD_TYPE_FLAGS: /* now get flags */
                      /* USER CODE BEGIN AD_TYPE_FLAGS */

                      /* USER CODE END AD_TYPE_FLAGS */
                      break;

                    case AD_TYPE_TX_POWER_LEVEL: /* Tx power level */
                      /* USER CODE BEGIN AD_TYPE_TX_POWER_LEVEL */

                      /* USER CODE END AD_TYPE_TX_POWER_LEVEL */
                      break;

                    case AD_TYPE_SHORTENED_LOCAL_NAME:
                    case AD_TYPE_COMPLETE_LOCAL_NAME:
                      {
                        /* Found a name, let's print it */
                        char name[32];
                        uint8_t len = adlength - 1;
                        if(len > 31) len = 31;
                        
                        memcpy(name, &adv_report_data[k+2], len);
                        name[len] = '\0';
                        
                        APP_DBG_MSG("Scan: Name: %s\n\r", name);
                        
                      }
                      break;

                    case AD_TYPE_SERVICE_DATA: /* service data 16 bits */
                      /* USER CODE BEGIN AD_TYPE_SERVICE_DATA */
                      
                      /* USER CODE END AD_TYPE_SERVICE_DATA */
                      break;

                    case AD_TYPE_16_BIT_SERV_UUID:
                      
                    case AD_TYPE_16_BIT_SERV_UUID_CMPLT_LIST:
                    {
                      uint8_t i = 0;
                      while ((i + 2) <= (adlength - 1)){
                        uint16_t uuid = (adv_report_data[k + 2 + i]) | (adv_report_data[k + 3 + i] << 8);

                        if (uuid == HRM_SERVICE_UUID) //if we've connected to a HR service
                        {
                          APP_DBG_MSG("-- HRM DEVICE FOUND! UUID: 0x180D. STOPPING SCAN... -- \n\r");
                          BleApplicationContext.DeviceServerFound = 0x01;

